Locked-Inc/STAR/star-rx72n-firmware/tests/test_rx_gpio.c
/**
 * @file test_rx_gpio.c
 * @brief Unit Tests for RX72N GPIO (PORT) Register Definitions
 *
 * @details
 * Comprehensive verification tests for the RX72N I/O Ports module (Chapter 22
 * of the hardware manual). This test suite validates:
 *
 * - **Register base addresses**: PDR, PODR, PIDR, PMR, ODR, PCR, DSCR bases
 * - **Port offset values**: Numeric ports (0-5), alpha ports (A-E), and Port J
 * - **Struct layout**: rx_port_regs_t field offsets match hardware spacing
 * - **Accessor functions**: All port-specific accessor functions return correct
 *   hardware addresses
 * - **ODR register layout**: Special 16-bit access for open-drain control
 * - **Field widths**: 8-bit registers except 16-bit ODR
 *
 * @par Test Coverage Summary
 * | Test Category          | Tests | Description                         |
 * |------------------------|-------|-------------------------------------|
 * | Base Addresses         | 1     | 7 register type bases verified      |
 * | Port Offsets           | 1     | 12 port offsets verified            |
 * | Struct Layout          | 2     | Field offsets and struct size       |
 * | Accessor Functions     | 9     | All port accessor functions         |
 * | ODR Layout             | 1     | 16-bit ODR register access          |
 * | Field Widths           | 1     | All register field sizes            |
 *
 * @par Test Framework
 * Uses Unity test framework (ThrowTheSwitch.org).
 * Tests are run on host machine (x86/x64), not on target hardware.
 *
 * @par Verification Methodology
 * Each test compares computed addresses against values from:
 * - RX72N Group User's Manual: Hardware (R01UH0824EJ0120 Rev.1.20)
 * - Chapter 22: I/O Ports, Table 22.1
 *
 * @par NASA Power of 10 Compliance
 * - Rule 1: Simple control flow (no goto, setjmp, recursion)
 * - Rule 2: N/A (no loops with iterations)
 * - Rule 3: No dynamic memory allocation
 * - Rule 4: Functions are short (< 60 lines each)
 * - Rule 5: Minimal assertions per test (1-7 per function)
 * - Rule 6: Minimal variable scope
 * - Rule 7: Return values verified via Unity assertions
 * - Rule 8: Limited preprocessor usage
 * - Rule 9: No function pointers in tests
 * - Rule 10: Compiled with -Wall -Wextra -Werror
 *
 * @par Module Dependencies
 * - rx72n_port_regs.h: Register definitions under test
 * - unity.h: Test framework
 * - stddef.h, stdint.h: Standard type definitions
 *
 * @par Build Command
 * @code{.sh}
 * cd star-rx72n-firmware/tests
 * cmake -B build && cmake --build build && ctest --test-dir build -V
 * @endcode
 *
 * @see rx72n_port_regs.h GPIO register definitions
 * @see Ch22_IO_Ports.txt Manual chapter extract
 *
 * @author Locked, Inc.
 * @date 2026-01-27
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#include <stddef.h>
#include <stdint.h>

#include "rx72n_port_regs.h"
#include "unity.h"

/* =============================================================================
 * Test Constants
 * =============================================================================
 */

/**
 * @enum gpio_test_addr_t
 * @brief Expected hardware addresses for GPIO register verification
 *
 * @details
 * All expected addresses from RX72N hardware manual Chapter 22 for
 * verifying GPIO port register accessors and struct field offsets.
 *
 * @since Version 1.0.0
 */
typedef enum : uintptr_t {
  /* PORT0 register addresses */
  k_gpio_port0_pdr  = 0x0008C000U, /**< PORT0.PDR address */
  k_gpio_port0_podr = 0x0008C020U, /**< PORT0.PODR address */
  k_gpio_port0_pidr = 0x0008C040U, /**< PORT0.PIDR address */
  k_gpio_port0_pmr  = 0x0008C060U, /**< PORT0.PMR address */
  k_gpio_port0_odr  = 0x0008C080U, /**< PORT0.ODR address */
  k_gpio_port0_pcr  = 0x0008C0C0U, /**< PORT0.PCR address */
  k_gpio_port0_dscr = 0x0008C0E0U, /**< PORT0.DSCR address */

  /* PORT1 register addresses */
  k_gpio_port1_base = 0x0008C001U, /**< PORT1 base (PDR) address */
  k_gpio_port1_podr = 0x0008C021U, /**< PORT1.PODR address */
  k_gpio_port1_pidr = 0x0008C041U, /**< PORT1.PIDR address */
  k_gpio_port1_pmr  = 0x0008C061U, /**< PORT1.PMR address */
  k_gpio_port1_odr  = 0x0008C082U, /**< PORT1.ODR address (16-bit spacing) */
  k_gpio_port1_pcr  = 0x0008C0C1U, /**< PORT1.PCR address */
  k_gpio_port1_dscr = 0x0008C0E1U, /**< PORT1.DSCR address */

  /* PORT2 register addresses */
  k_gpio_port2_base = 0x0008C002U, /**< PORT2 base (PDR) address */
  k_gpio_port2_podr = 0x0008C022U, /**< PORT2.PODR address */
  k_gpio_port2_pidr = 0x0008C042U, /**< PORT2.PIDR address */

  /* PORTA register addresses */
  k_gpio_porta_base = 0x0008C00AU, /**< PORTA base (PDR) address */
  k_gpio_porta_podr = 0x0008C02AU, /**< PORTA.PODR address */
  k_gpio_porta_pidr = 0x0008C04AU, /**< PORTA.PIDR address */
  k_gpio_porta_pmr  = 0x0008C06AU, /**< PORTA.PMR address */
  k_gpio_porta_odr  = 0x0008C094U, /**< PORTA.ODR address */
  k_gpio_porta_pcr  = 0x0008C0CAU, /**< PORTA.PCR address */
  k_gpio_porta_dscr = 0x0008C0EAU, /**< PORTA.DSCR address */

  /* PORTB register addresses */
  k_gpio_portb_base = 0x0008C00BU, /**< PORTB base (PDR) address */
  k_gpio_portb_podr = 0x0008C02BU, /**< PORTB.PODR address */

  /* PORTC register addresses */
  k_gpio_portc_base = 0x0008C00CU, /**< PORTC base (PDR) address */
  k_gpio_portc_podr = 0x0008C02CU, /**< PORTC.PODR address */

  /* PORTD register addresses */
  k_gpio_portd_base = 0x0008C00DU, /**< PORTD base (PDR) address */
  k_gpio_portd_podr = 0x0008C02DU, /**< PORTD.PODR address */

  /* PORTE register addresses */
  k_gpio_porte_base = 0x0008C00EU, /**< PORTE base (PDR) address */
  k_gpio_porte_podr = 0x0008C02EU, /**< PORTE.PODR address */

  /* PORTJ register addresses */
  k_gpio_portj_base = 0x0008C012U, /**< PORTJ base (PDR) address */
  k_gpio_portj_podr = 0x0008C032U, /**< PORTJ.PODR address */
  k_gpio_portj_pidr = 0x0008C052U, /**< PORTJ.PIDR address */
  k_gpio_portj_pmr  = 0x0008C072U, /**< PORTJ.PMR address */
  k_gpio_portj_odr  = 0x0008C0A4U, /**< PORTJ.ODR address */
  k_gpio_portj_pcr  = 0x0008C0D2U, /**< PORTJ.PCR address */
  k_gpio_portj_dscr = 0x0008C0F2U, /**< PORTJ.DSCR address */
} gpio_test_addr_t;

/**
 * @enum gpio_test_offset_t
 * @brief Expected struct offsets for GPIO register layout verification
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_gpio_off_pdr  = 0x00U, /**< PDR offset in struct */
  k_gpio_off_podr = 0x20U, /**< PODR offset in struct */
  k_gpio_off_pidr = 0x40U, /**< PIDR offset in struct */
  k_gpio_off_pmr  = 0x60U, /**< PMR offset in struct */
  k_gpio_off_pcr  = 0xC0U, /**< PCR offset in struct */
  k_gpio_off_dscr = 0xE0U, /**< DSCR offset in struct */
} gpio_test_offset_t;

/**
 * @enum gpio_test_size_t
 * @brief Expected sizes for GPIO struct and register verification
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_gpio_struct_size = 0x129U, /**< Total rx_port_regs_t size (297 bytes) */
  k_gpio_reg_8bit    = 1U,     /**< 8-bit register size */
  k_gpio_reg_16bit   = 2U,     /**< 16-bit register size (ODR) */
  k_gpio_odr_spacing = 2U,     /**< Inter-port ODR spacing (bytes) */
} gpio_test_size_t;

