Locked-Inc/STAR/star-rx72n-firmware/tests/test_rx_gpio.c
/* =============================================================================
 * Test Setup and Teardown
 * =============================================================================
 */

/**
 * @brief Unity test setup fixture - called before each test
 *
 * @details
 * Initializes test environment. Currently no state to reset since tests
 * only verify constant addresses and struct layouts.
 *
 * @note Called automatically by Unity framework via RUN_TEST() macro
 *
 * @since Version 1.0.0
 */
void setUp(void)
{
  /* No state to initialize - tests are address verification only */
}

/**
 * @brief Unity test teardown fixture - called after each test
 *
 * @details
 * Cleans up test environment. Currently no cleanup required.
 *
 * @note Called automatically by Unity framework after each test
 *
 * @since Version 1.0.0
 */
void tearDown(void)
{
  /* No cleanup required */
}

/* =============================================================================
 * Register Base Address Tests
 * =============================================================================
 */

/**
 * @brief Verify PORT register base addresses match RX72N hardware manual Ch22
 *
 * @details
 * Validates all 7 register type base addresses against Table 22.1 of the
 * RX72N hardware manual. The I/O port registers are memory-mapped starting
 * at 0x0008C000 with 32-byte spacing between register types.
 *
 * @par Register Base Address Map (Ch22 Table 22.1)
 * | Register | Base Address | Description                         |
 * |----------|--------------|-------------------------------------|
 * | PDR      | 0x0008C000   | Port Direction Register (input/out) |
 * | PODR     | 0x0008C020   | Port Output Data Register           |
 * | PIDR     | 0x0008C040   | Port Input Data Register            |
 * | PMR      | 0x0008C060   | Port Mode Register (GPIO/periph)    |
 * | ODR0     | 0x0008C080   | Open Drain Control Register 0       |
 * | PCR      | 0x0008C0C0   | Pull-up Control Register            |
 * | DSCR     | 0x0008C0E0   | Drive Capacity Control Register     |
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies k_port_pdr_base through k_port_dscr_base enum values
 *
 * @since Version 1.0.0
 */
void test_port_base_addresses(void)
{
  /* PDR (Port Direction Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_pdr, k_port_pdr_base);

  /* PODR (Port Output Data Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_podr, k_port_podr_base);

  /* PIDR (Port Input Data Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_pidr, k_port_pidr_base);

  /* PMR (Port Mode Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_pmr, k_port_pmr_base);

  /* ODR0 (Open Drain Control 0) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_odr, k_port_odr0_base);

  /* PCR (Pull-up Control Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_pcr, k_port_pcr_base);

  /* DSCR (Drive Capacity Control Register) base */
  TEST_ASSERT_EQUAL_HEX32(k_gpio_port0_dscr, k_port_dscr_base);
}

/* =============================================================================
 * Port Offset Tests (144-pin LFQFP)
 * =============================================================================
 */

/**
 * @brief Verify port offset values for 144-pin LFQFP package
 *
 * @details
 * Each port has a fixed offset from the register base address. The RX72N
 * 144-pin LFQFP package supports ports 0-9, A-E, and J. Port offsets are
 * added to register base addresses to get the specific port's register.
 *
 * @par Port Offset Calculation Example
 * @code
 * PORT3.PDR = PDR_base + PORT3_offset = 0x0008C000 + 0x03 = 0x0008C003
 * PORTB.PODR = PODR_base + PORTB_offset = 0x0008C020 + 0x0B = 0x0008C02B
 * @endcode
 *
 * @par Available Ports (144-pin LFQFP)
 * | Port  | Offset | Pins Available              |
 * |-------|--------|------------------------------|
 * | 0     | 0x00   | P00-P07 (8 pins)            |
 * | 1     | 0x01   | P10-P17 (8 pins)            |
 * | 2     | 0x02   | P20-P27 (8 pins)            |
 * | 3     | 0x03   | P30-P37 (8 pins)            |
 * | 4     | 0x04   | P40-P47 (8 pins)            |
 * | 5     | 0x05   | P50-P57 (8 pins)            |
 * | 6     | 0x06   | P60-P67 (partial)           |
 * | 7     | 0x07   | P70-P77 (8 pins)            |
 * | 8     | 0x08   | P80-P87 (partial)           |
 * | 9     | 0x09   | P90-P97 (8 pins)            |
 * | A     | 0x0A   | PA0-PA7 (8 pins)            |
 * | B     | 0x0B   | PB0-PB7 (8 pins)            |
 * | C     | 0x0C   | PC0-PC7 (8 pins)            |
 * | D     | 0x0D   | PD0-PD7 (8 pins)            |
 * | E     | 0x0E   | PE0-PE7 (8 pins)            |
 * | F     | 0x0F   | PF0-PF5 (partial)           |
 * | J     | 0x12   | PJ3, PJ5 (partial)          |
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies k_port_offset_0 through k_port_offset_j enum values
 *
 * @since Version 1.0.0
 */
void test_port_offsets(void)
{
  /* Numeric ports (0-5) */
  TEST_ASSERT_EQUAL_UINT8(0x00, k_port_offset_0);
  TEST_ASSERT_EQUAL_UINT8(0x01, k_port_offset_1);
  TEST_ASSERT_EQUAL_UINT8(0x02, k_port_offset_2);
  TEST_ASSERT_EQUAL_UINT8(0x03, k_port_offset_3);
  TEST_ASSERT_EQUAL_UINT8(0x04, k_port_offset_4);
  TEST_ASSERT_EQUAL_UINT8(0x05, k_port_offset_5);

  /* Alpha ports (A-E) */
  TEST_ASSERT_EQUAL_UINT8(0x0A, k_port_offset_a);
  TEST_ASSERT_EQUAL_UINT8(0x0B, k_port_offset_b);
  TEST_ASSERT_EQUAL_UINT8(0x0C, k_port_offset_c);
  TEST_ASSERT_EQUAL_UINT8(0x0D, k_port_offset_d);
  TEST_ASSERT_EQUAL_UINT8(0x0E, k_port_offset_e);

  /* Port J */
  TEST_ASSERT_EQUAL_UINT8(0x12, k_port_offset_j);
}

/* =============================================================================
 * Struct Layout Tests
 * =============================================================================
 */

/**
 * @brief Verify rx_port_regs_t struct field offsets match hardware layout
 *
 * @details
 * The rx_port_regs_t structure mirrors the hardware register layout for a
 * single port. Field offsets must match the 32-byte spacing between register
 * types in hardware. This test uses offsetof() to verify correct padding.
 *
 * @par Expected Struct Layout
 * | Offset | Field | Size   | Description                      |
 * |--------|-------|--------|----------------------------------|
 * | 0x00   | pdr   | 1 byte | Port Direction Register          |
 * | 0x20   | podr  | 1 byte | Port Output Data Register        |
 * | 0x40   | pidr  | 1 byte | Port Input Data Register         |
 * | 0x60   | pmr   | 1 byte | Port Mode Register               |
 * | 0x80   | odr   | 2 bytes| Open Drain Control (ODR0+ODR1)   |
 * | 0xC0   | pcr   | 1 byte | Pull-up Control Register         |
 * | 0xE0   | dscr  | 1 byte | Drive Capacity Control Register  |
 *
 * @note Padding bytes between fields are required to achieve 32-byte alignment
 *
 * @pre None
 * @post No state changes
 *
 * @test Uses offsetof() macro to verify compile-time field positions
 *
 * @since Version 1.0.0
 */
void test_port_struct_offsets(void)
{
  /* Verify each register offset within the struct */
  /* Note: ODR is not in struct - uses word-addressed accessor functions */
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_pdr, offsetof(rx_port_regs_t, pdr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_podr, offsetof(rx_port_regs_t, podr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_pidr, offsetof(rx_port_regs_t, pidr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_pmr, offsetof(rx_port_regs_t, pmr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_pcr, offsetof(rx_port_regs_t, pcr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_off_dscr, offsetof(rx_port_regs_t, dscr));
}

/**
 * @brief Verify rx_port_regs_t struct total size is correct
 *
 * @details
 * The structure spans from PDR (0x00) to DSCR (0xE0) plus 1 byte for DSCR
 * itself, giving a total size of 0xE1 (225) bytes. This size ensures the
 * structure correctly covers all register addresses for a single port.
 *
 * @par Size Calculation
 * @code
 * struct_size = last_field_offset + last_field_size
 *             = 0xE0 (DSCR offset) + 1 (DSCR size)
 *             = 0xE1 = 225 bytes
 * @endcode
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies sizeof(rx_port_regs_t) == 0x129 (297 bytes)
 *
 * @note Updated from 0xE1 (225 bytes) to include DSCR2 register at +0x128
 *
 * @since Version 1.0.0
 */
void test_port_struct_size(void)
{
  /* Struct size should be 0x129 (297 bytes) - includes DSCR2 register */
  TEST_ASSERT_EQUAL_size_t(k_gpio_struct_size, sizeof(rx_port_regs_t));
}

