Locked-Inc/STAR/star-rx72n-firmware/tests/test_rx_gpio.c
/* =============================================================================
 * Accessor Function Tests
 * =============================================================================
 */

/**
 * @brief Verify PORT0 accessor function returns correct hardware addresses
 *
 * @details
 * Tests the port0() inline accessor function which provides type-safe access
 * to PORT0 registers. Verifies both the base pointer address and derived
 * register addresses through struct member access.
 *
 * @par PORT0 Register Addresses (144-pin LFQFP)
 * | Register    | Address    | Description              |
 * |-------------|------------|--------------------------|
 * | PORT0.PDR   | 0x0008C000 | Direction (0=in, 1=out)  |
 * | PORT0.PODR  | 0x0008C020 | Output data              |
 * | PORT0.PIDR  | 0x0008C040 | Input data (read-only)   |
 * | PORT0.PMR   | 0x0008C060 | Mode (0=GPIO, 1=periph)  |
 * | PORT0.ODR   | 0x0008C080 | Open drain control       |
 * | PORT0.PCR   | 0x0008C0C0 | Pull-up enable           |
 * | PORT0.DSCR  | 0x0008C0E0 | Drive strength           |
 *
 * @pre None
 * @post No state changes (read-only address verification)
 *
 * @test Verifies port0() == 0x0008C000 and all derived register addresses
 *
 * @since Version 1.0.0
 */
void test_port0_accessor(void)
{
  volatile rx_port_regs_t* p = port0();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_pdr, (uintptr_t)p);

  /* Verify individual register addresses */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_pdr, (uintptr_t)&p->pdr);     /* PDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_podr, (uintptr_t)&p->podr);   /* PODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_pidr, (uintptr_t)&p->pidr);   /* PIDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_pmr, (uintptr_t)&p->pmr);     /* PMR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_odr, (uintptr_t)port0_odr()); /* ODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_pcr, (uintptr_t)&p->pcr);     /* PCR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_dscr, (uintptr_t)&p->dscr);   /* DSCR */
}

/**
 * @brief Verify PORT1 accessor function returns correct hardware addresses
 *
 * @details
 * Tests the port1() inline accessor function. PORT1 is at offset 0x01 from
 * the base, so PORT1.PDR is at 0x0008C001, etc. Note that ODR uses 16-bit
 * addressing, so PORT1.ODR is at 0x0008C082 (2-byte offset from PORT0.ODR).
 *
 * @par PORT1 Register Addresses
 * | Register    | Address    | Notes                    |
 * |-------------|------------|--------------------------|
 * | PORT1.PDR   | 0x0008C001 | Base + 0x01              |
 * | PORT1.PODR  | 0x0008C021 | Base + 0x20 + 0x01       |
 * | PORT1.PIDR  | 0x0008C041 | Base + 0x40 + 0x01       |
 * | PORT1.PMR   | 0x0008C061 | Base + 0x60 + 0x01       |
 * | PORT1.ODR   | 0x0008C082 | Base + 0x80 + 0x02 (16b) |
 * | PORT1.PCR   | 0x0008C0C1 | Base + 0xC0 + 0x01       |
 * | PORT1.DSCR  | 0x0008C0E1 | Base + 0xE0 + 0x01       |
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies port1() returns correct base and register addresses
 *
 * @since Version 1.0.0
 */
void test_port1_accessor(void)
{
  volatile rx_port_regs_t* p = port1();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_base, (uintptr_t)p);

  /* Verify individual register addresses */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_base, (uintptr_t)&p->pdr);    /* PDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_podr, (uintptr_t)&p->podr);   /* PODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_pidr, (uintptr_t)&p->pidr);   /* PIDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_pmr, (uintptr_t)&p->pmr);     /* PMR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_odr, (uintptr_t)port1_odr()); /* ODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_pcr, (uintptr_t)&p->pcr);     /* PCR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_dscr, (uintptr_t)&p->dscr);   /* DSCR */
}

/**
 * @brief Verify PORT2 accessor function returns correct hardware addresses
 *
 * @details
 * Tests the port2() inline accessor function. PORT2 is commonly used for
 * peripheral functions in the STAR project.
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies port2() == 0x0008C002 and key register addresses
 *
 * @since Version 1.0.0
 */
void test_port2_accessor(void)
{
  volatile rx_port_regs_t* p = port2();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port2_base, (uintptr_t)p);

  /* Verify key registers */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port2_base, (uintptr_t)&p->pdr);  /* PDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port2_podr, (uintptr_t)&p->podr); /* PODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port2_pidr, (uintptr_t)&p->pidr); /* PIDR */
}

/**
 * @brief Verify PORTA accessor function returns correct hardware addresses
 *
 * @details
 * Tests the porta() inline accessor function. PORTA (offset 0x0A) is the first
 * alphabetic port, used for various peripheral connections in the STAR project.
 * Note that ODR addressing for alpha ports uses 2-byte steps: PORTA.ODR is at
 * 0x0008C094 (base + 0x80 + 0x0A*2 = 0x0008C094).
 *
 * @par PORTA Register Addresses
 * | Register    | Address    | Notes                    |
 * |-------------|------------|--------------------------|
 * | PORTA.PDR   | 0x0008C00A | GPIO direction           |
 * | PORTA.PODR  | 0x0008C02A | Output data              |
 * | PORTA.PIDR  | 0x0008C04A | Input data               |
 * | PORTA.PMR   | 0x0008C06A | Peripheral mode          |
 * | PORTA.ODR   | 0x0008C094 | Open drain (0x80+0x14)   |
 * | PORTA.PCR   | 0x0008C0CA | Pull-up control          |
 * | PORTA.DSCR  | 0x0008C0EA | Drive strength           |
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies porta() returns correct base and all register addresses
 *
 * @since Version 1.0.0
 */
void test_porta_accessor(void)
{
  volatile rx_port_regs_t* p = porta();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_base, (uintptr_t)p);

  /* Verify individual register addresses */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_base, (uintptr_t)&p->pdr);    /* PDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_podr, (uintptr_t)&p->podr);   /* PODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_pidr, (uintptr_t)&p->pidr);   /* PIDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_pmr, (uintptr_t)&p->pmr);     /* PMR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_odr, (uintptr_t)porta_odr()); /* ODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_pcr, (uintptr_t)&p->pcr);     /* PCR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porta_dscr, (uintptr_t)&p->dscr);   /* DSCR */
}

/**
 * @brief Verify PORTB accessor function returns correct hardware addresses
 *
 * @details
 * Tests portb() accessor. PORTB (offset 0x0B) is used for ELC event ports
 * and general I/O in the STAR project.
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies portb() == 0x0008C00B and key register addresses
 *
 * @since Version 1.0.0
 */
void test_portb_accessor(void)
{
  volatile rx_port_regs_t* p = portb();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portb_base, (uintptr_t)p);

  /* Verify key registers */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portb_base, (uintptr_t)&p->pdr);
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portb_podr, (uintptr_t)&p->podr);
}

/**
 * @brief Verify PORTC accessor function returns correct hardware addresses
 *
 * @details
 * Tests portc() accessor. PORTC (offset 0x0C) is commonly used for
 * communication peripherals (SCI, SPI).
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies portc() == 0x0008C00C and key register addresses
 *
 * @since Version 1.0.0
 */
void test_portc_accessor(void)
{
  volatile rx_port_regs_t* p = portc();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portc_base, (uintptr_t)p);

  /* Verify key registers */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portc_base, (uintptr_t)&p->pdr);
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portc_podr, (uintptr_t)&p->podr);
}

/**
 * @brief Verify PORTD accessor function returns correct hardware addresses
 *
 * @details
 * Tests portd() accessor. PORTD (offset 0x0D) is used for ADC inputs and
 * general purpose I/O.
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies portd() == 0x0008C00D and key register addresses
 *
 * @since Version 1.0.0
 */
void test_portd_accessor(void)
{
  volatile rx_port_regs_t* p = portd();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portd_base, (uintptr_t)p);

  /* Verify key registers */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portd_base, (uintptr_t)&p->pdr);
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portd_podr, (uintptr_t)&p->podr);
}

/**
 * @brief Verify PORTE accessor function returns correct hardware addresses
 *
 * @details
 * Tests porte() accessor. PORTE (offset 0x0E) is the last alphabetic port,
 * used for ELC event ports and general I/O.
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies porte() == 0x0008C00E and key register addresses
 *
 * @since Version 1.0.0
 */
void test_porte_accessor(void)
{
  volatile rx_port_regs_t* p = porte();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porte_base, (uintptr_t)p);

  /* Verify key registers */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porte_base, (uintptr_t)&p->pdr);
  TEST_ASSERT_EQUAL_HEX64(k_gpio_porte_podr, (uintptr_t)&p->podr);
}

/**
 * @brief Verify PORTJ accessor function returns correct hardware addresses
 *
 * @details
 * Tests portj() accessor. PORTJ (offset 0x12) is a special-purpose port
 * with limited pins (PJ3 and PJ5 available on 144-pin LFQFP). PJ3 is the
 * E2 emulator debug pin (MD/FINED function).
 *
 * @par PORTJ Register Addresses
 * | Register    | Address    | Notes                    |
 * |-------------|------------|--------------------------|
 * | PORTJ.PDR   | 0x0008C012 | Direction for PJ3 only   |
 * | PORTJ.PODR  | 0x0008C032 | Output data              |
 * | PORTJ.PIDR  | 0x0008C052 | Input data               |
 * | PORTJ.PMR   | 0x0008C072 | Mode register            |
 * | PORTJ.ODR   | 0x0008C0A4 | Open drain (0x80+0x24)   |
 * | PORTJ.PCR   | 0x0008C0D2 | Pull-up control          |
 * | PORTJ.DSCR  | 0x0008C0F2 | Drive strength           |
 *
 * @warning Only PJ3 and PJ5 are available on 144-pin package - other bits reserved
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies portj() returns correct base and all register addresses
 *
 * @since Version 1.0.0
 */
void test_portj_accessor(void)
{
  volatile rx_port_regs_t* p = portj();
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_base, (uintptr_t)p);

