Locked-Inc/STAR/star-rx72n-firmware/tests/test_rx_gpio.c
  /* Verify individual register addresses */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_base, (uintptr_t)&p->pdr);    /* PDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_podr, (uintptr_t)&p->podr);   /* PODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_pidr, (uintptr_t)&p->pidr);   /* PIDR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_pmr, (uintptr_t)&p->pmr);     /* PMR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_odr, (uintptr_t)portj_odr()); /* ODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_pcr, (uintptr_t)&p->pcr);     /* PCR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_portj_dscr, (uintptr_t)&p->dscr);   /* DSCR */
}

/* =============================================================================
 * ODR Register Tests
 * =============================================================================
 */

/**
 * @brief Verify ODR register 16-bit layout and inter-port spacing
 *
 * @details
 * The Open Drain Control Register (ODR) is unique among port registers in
 * that it uses 16-bit access. Each port has two 8-bit registers (ODR0 for
 * bits 0-3, ODR1 for bits 4-7) that are accessed as a single 16-bit value.
 *
 * @par ODR Register Layout
 * @code
 * ODR (16-bit):
 * [15:12] Reserved
 * [11:8]  ODR1 - Open drain for pins Pn4-Pn7 (B7-B4 bits)
 * [7:4]   Reserved
 * [3:0]   ODR0 - Open drain for pins Pn0-Pn3 (B3-B0 bits)
 * @endcode
 *
 * @par Inter-Port ODR Spacing
 * ODR registers are spaced 2 bytes apart (16-bit access):
 * - PORT0.ODR: 0x0008C080
 * - PORT1.ODR: 0x0008C082
 * - PORT2.ODR: 0x0008C084
 * - etc.
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies ODR size is 2 bytes and inter-port spacing is 2 bytes
 *
 * @since Version 1.0.0
 */
void test_odr_layout(void)
{
  /* ODR is 16-bit register accessed via dedicated accessor functions */
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_16bit, sizeof(*port0_odr()));

  /* Verify ODR address spacing between ports (word addressing) */
  /* PORT0.ODR at 0x0008C080, PORT1.ODR at 0x0008C082 (2-byte spacing) */
  uintptr_t odr0_addr = (uintptr_t)port0_odr();
  uintptr_t odr1_addr = (uintptr_t)port1_odr();

  TEST_ASSERT_EQUAL_HEX64(k_gpio_port0_odr, odr0_addr); /* PORT0.ODR */
  TEST_ASSERT_EQUAL_HEX64(k_gpio_port1_odr, odr1_addr); /* PORT1.ODR */
  TEST_ASSERT_EQUAL_UINT32(k_gpio_odr_spacing, odr1_addr - odr0_addr);
}

/* =============================================================================
 * Register Field Width Tests
 * =============================================================================
 */

/**
 * @brief Verify all register field widths are correct (8-bit except ODR)
 *
 * @details
 * Most port registers are 8-bit (one bit per pin on the port). The exception
 * is ODR which is 16-bit (combines ODR0 and ODR1 for 8-bit port access).
 *
 * @par Expected Field Sizes
 * | Register | Size   | Access | Notes                         |
 * |----------|--------|--------|-------------------------------|
 * | PDR      | 8-bit  | R/W    | 1 bit per pin (direction)     |
 * | PODR     | 8-bit  | R/W    | 1 bit per pin (output data)   |
 * | PIDR     | 8-bit  | R      | 1 bit per pin (input data)    |
 * | PMR      | 8-bit  | R/W    | 1 bit per pin (peripheral)    |
 * | ODR      | 16-bit | R/W    | 2 bits per pin (open drain)   |
 * | PCR      | 8-bit  | R/W    | 1 bit per pin (pull-up)       |
 * | DSCR     | 8-bit  | R/W    | 1 bit per pin (drive strength)|
 *
 * @pre None
 * @post No state changes
 *
 * @test Verifies sizeof() for each register field in rx_port_regs_t
 *
 * @since Version 1.0.0
 */
void test_register_field_widths(void)
{
  /* All single registers should be 8-bit (1 byte) */
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->pdr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->podr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->pidr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->pmr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->pcr));
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_8bit, sizeof(((rx_port_regs_t*)0)->dscr));

  /* ODR should be 16-bit (2 bytes) - accessed via port*_odr() functions */
  TEST_ASSERT_EQUAL_size_t(k_gpio_reg_16bit, sizeof(*port0_odr()));
}

/* =============================================================================
 * Test Runner
 * =============================================================================
 */

/**
 * @brief Unity test runner main function
 *
 * @details
 * Executes all GPIO register verification tests in the following groups:
 * 1. Register Base Address Tests (7 assertions)
 * 2. Port Offset Tests (12 assertions)
 * 3. Struct Layout Tests (8 assertions)
 * 4. Accessor Function Tests (9 test functions, ~45 assertions)
 * 5. ODR Register Tests (4 assertions)
 * 6. Register Field Width Tests (7 assertions)
 *
 * @return int 0 on all tests pass, non-zero on failure
 *
 * @par Exit Codes
 * - 0: All tests passed
 * - Non-zero: Number of failed tests
 *
 * @note Run via: `ctest --test-dir build -V` from tests/ directory
 *
 * @since Version 1.0.0
 */
int main(void)
{
  UNITY_BEGIN();

  /* Register Base Address Tests */
  RUN_TEST(test_port_base_addresses);

  /* Port Offset Tests */
  RUN_TEST(test_port_offsets);

  /* Struct Layout Tests */
  RUN_TEST(test_port_struct_offsets);
  RUN_TEST(test_port_struct_size);

  /* Accessor Function Tests */
  RUN_TEST(test_port0_accessor);
  RUN_TEST(test_port1_accessor);
  RUN_TEST(test_port2_accessor);
  RUN_TEST(test_porta_accessor);
  RUN_TEST(test_portb_accessor);
  RUN_TEST(test_portc_accessor);
  RUN_TEST(test_portd_accessor);
  RUN_TEST(test_porte_accessor);
  RUN_TEST(test_portj_accessor);

  /* ODR Register Tests */
  RUN_TEST(test_odr_layout);

  /* Register Field Width Tests */
  RUN_TEST(test_register_field_widths);

  return UNITY_END();
}
